{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "hi",
        "How are you",
        "It's good to see you",
        "What's up?",
        " Hi there!",
        "Hello!",
        "Good morning!",
        "Good afternoon!",
        "Good evening!",
        "Hey!",
        "Greetings!",
        "Salutations!",
        "Howdy!",
        "Yo!",
        "Hiya!",
        "Sup!",
        "What's up?",
        "How's it going?",
        "Nice to see you!",
        "It's great to see you!",
        "How have you been?",
        "Long time no see!",
        "What's new?",
        "Hey, what's happening?",
        "Hi, how are you doing?",
        "What's going on?",
        "How's your day going?",
        "Good to see you!",
        "Hi, stranger!",
        "How are things?",
        "Good to meet you!",
        "Nice to meet you!",
        "How you doing?"
      ],
      "responses": [
        "Hi!",
        "Hello, how can I help you?",
        "Hi, what can I do for you?",
        "Hi, nice to see you! What do you need?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Bye",
        "see you later!",
        "goodbye",
        "I need to go",
        "Goodbye!",
        "Farewell!",
        "See you later!",
        "Catch you later!",
        "See ya!",
        "Later!",
        "Take care!",
        "Bye for now!",
        "Bye-bye!",
        "Adios!",
        "So long!",
        "Hasta la vista!",
        "Until next time!",
        "Have a good one!",
        "Have a great day!",
        "Have a good night!",
        "See you soon!",
        "Talk to you later!",
        "Peace out!",
        "Stay safe!",
        "Bye, see you later!",
        "All the best!",
        "Take it easy!",
        "Have a good weekend!",
        "I'll see you around!",
        "Goodnight!",
        "Sweet dreams!",
        "Have a good trip!",
        "Bon voyage!",
        "Enjoy your day!",
        "Enjoy your evening!",
        "Keep in touch!",
        "Don't be a stranger!",
        "It was nice seeing you!",
        "Thanks for stopping by!",
        "Take care of yourself!",
        "Good luck with everything!",
        "Have a safe journey!",
        "See you on the flip side!",
        "Have a pleasant evening!",
        "Goodbye, my friend!",
        "Bye, take care!",
        "See you next time!",
        "Until we meet again!",
        "Have a good one, mate!",
        "I'll miss you!",
        "Take care, my friend!",
        "It was great to see you!",
        "Thanks for the visit!",
        "Have a great week!"
      ],
      "responses": ["Bye!", "Have a nice day", "Bye, see you around!"]
    },
    {
      "tag": "thanks",
      "patterns": [
        "Thank you so much for your help, I couldn't have done it without you!",
        "I really appreciate all the help you gave me, thank you!",
        "I just wanted to say a quick thank you for your assistance, it meant a lot to me.",
        "I'm grateful for your help, thank you!",
        "Thank you for going above and beyond to help me, it's truly appreciated.",
        "You were such a huge help, thank you from the bottom of my heart.",
        "I can't thank you enough for your assistance, you made a real difference.",
        "Thank you for being there for me when I needed help, it meant a lot.",
        "You have my deepest thanks for all your help, I couldn't have done it without you.",
        "I'm so grateful for your help, thank you a million times over.",
        "Thank you for taking the time to assist me, I really appreciate it.",
        "Your help was invaluable, thank you so much.",
        "I'm indebted to you for your help, thank you!",
        "Thank you for being so kind and helpful, it was really appreciated.",
        "You're a lifesaver, thank you for your help.",
        "Thank you for being such a great support system, your help means the world to me.",
        "I'm so grateful for your assistance, thank you for everything.",
        "Thank you for being there for me and helping me through this.",
        "I just wanted to take a moment to thank you for all your help, you're amazing.",
        "I couldn't have done it without your help, thank you from the bottom of my heart.",
        "Thank you for your guidance and support, it was truly appreciated.",
        "You went above and beyond to help me, thank you so much.",
        "Thank you for being such a kind and generous helper, it means so much to me.",
        "I'm so grateful for your help, thank you for being amazing.",
        "Your help was invaluable, thank you for all you did.",
        "Thank you for being a constant source of support and help, I really appreciate it.",
        "I wanted to express my gratitude for your help, thank you so much.",
        "Thank you for being such a patient and understanding helper, I couldn't have asked for more.",
        "Your help made all the difference, thank you from the bottom of my heart.",
        "Thank you for being such a reliable and dependable helper, it means a lot.",
        "I'm so grateful for your assistance, thank you for your time and effort.",
        "Thank you for being such a wonderful help, you're truly appreciated.",
        "I just wanted to thank you for all your help and support, you're amazing.",
        "Your help was crucial, thank you for all you did for me.",
        "I couldn't have done it without your help, thank you for being there for me.",
        "Thank you for your hard work and dedication, it made all the difference.",
        "I'm so grateful for your help, thank you for your patience and understanding.",
        "Thank you for your kindness and generosity, your help meant a lot.",
        "I wanted to express my heartfelt thanks for your help, it was truly appreciated.",
        "Your help was a real game-changer, thank you so much."
      ],
      "responses": [
        "No problem, that's what I am for",
        "I'm glad to hear that.",
        "At your service!"
      ]
    },
    {
      "tag": "weather",
      "patterns": [
        "What is the current weather?",
        "What's the weather like today?",
        "How's the weather outside?",
        "Is it going to rain today?",
        "Is it hot out there?",
        "Is it cold today?",
        "What's the temperature right now?",
        "What's the forecast for today?",
        "Will it be sunny today?",
        "Is it windy outside?",
        "Are we expecting any storms today?",
        "Will it be cloudy today?",
        "What's the humidity like today?",
        "How's the air quality today?",
        "Will there be any snow today?",
        "Is there a chance of thunderstorms today?",
        "How's the visibility outside?",
        "What's the UV index today?",
        "Is it going to be a nice day today?",
        "Is it going to be a hot summer?",
        "Are we in for a cold winter?",
        "Is the weather going to change today?",
        "What's the weather like in?",
        "What's the weather been like lately?",
        "What's the weather going to be like tomorrow?",
        "Are we expecting any severe weather today?",
        "What's the dew point today?",
        "Is it going to be a humid day today?",
        "What's the chance of precipitation today?",
        "How's the weather for outdoor activities today?",
        "Is it going to be a good day for a picnic?",
        "Is it going to be a good day to go to the beach?",
        "What's the weather like in the mountains today?",
        "Is it going to be a good day for hiking?"
      ],
      "responses": ["I do not how to answer those types of questions yet"]
    },

    {
      "tag": "creators",
      "patterns": [
        "Who's you creator?",
        "Who made you?",
        "Who created you?",
        "Can you tell me about your creators?",
        "Who developed your AI?",
        "Who trained you to understand human language?",
        "Who designed your user interface?",
        "Who programmed your conversational abilities?",
        "Who wrote your code?",
        "Who is responsible for your maintenance?",
        "Who is the team behind your development?",
        "Who funded your creation?",
        "Who had the original idea for your creation?",
        "Who is the CEO of the company that created you?",
        "Who is the lead developer on your project?",
        "Who is your primary designer?",
        "Who came up with your name?",
        "Who oversees your daily operations?",
        "Who manages your database?",
        "Who is responsible for ensuring your privacy and security?",
        "Who is responsible for troubleshooting when you encounter errors?",
        "Who is responsible for improving your natural language processing abilities?",
        "Who decides which features to add to your platform?",
        "Who is responsible for making updates to your software?",
        "Who is responsible for ensuring your compatibility with different devices?",
        "Who is responsible for your marketing and promotion?",
        "Who is responsible for your customer service and support?",
        "Who are the individuals that make up your development team?",
        "Who are your investors?",
        "Who is responsible for your intellectual property?",
        "Who is responsible for your server maintenance?",
        "Who is responsible for your hosting?",
        "Who is responsible for managing your user data?",
        "Who is responsible for managing your cloud infrastructure?",
        "Who is responsible for your website and online presence?",
        "Who is responsible for your branding and visual identity?",
        "Who is responsible for your public relations?",
        "Who is responsible for your social media presence?",
        "Who is responsible for your content strategy?",
        "Who is responsible for your user experience design?",
        "Who is responsible for your accessibility features?",
        "Who is responsible for your chatbot's personality?",
        "Who is responsible for the development of your voice assistant functionality?",
        "Who is responsible for your conversational AI research?",
        "Who is responsible for your speech recognition technology?",
        "Who is responsible for your text-to-speech technology?",
        "Who is responsible for your machine learning algorithms?",
        "Who is responsible for your natural language understanding technology?",
        "Who is responsible for your data analytics?",
        "Who is responsible for your user testing and feedback?",
        "Who is responsible for your product strategy?",
        "Who is responsible for your long-term vision and roadmap?",
        "Who taught you everything?",
        "How are you able to respond like that?"
      ],
      "responses": [
        "My creators are Natalia Adamiak and Filip Dziurdzia. For more information visit contact page."
      ]
    },
    {
      "tag": "purpose",
      "patterns": [
        "What do you do?",
        "What can you do for me?",
        "How can you help me?",
        "What is your purpose?",
        "Who are you?",
        "What is your purpose?",
        "What are you designed to do?",
        "What problems do you solve?",
        "Why were you created?",
        "What is your main function?",
        "What do you offer to users?",
        "What benefits do you provide?",
        "What are your goals?",
        "What is your intended use case?",
        "What is the purpose of your platform?",
        "What inspired your creation?",
        "What makes you different from other chatbots?",
        "What value do you bring to users?",
        "What is your unique selling proposition?",
        "What kind of problems can you help me with?",
        "What are your limitations?",
        "What is your target audience?",
        "What kind of interactions are you meant for?",
        "What types of questions can you answer?",
        "What kind of information can you provide?",
        "What are your core features?",
        "What kind of data do you use to make decisions?",
        "What is the scope of your knowledge?",
        "What kind of situations can you assist with?",
        "What is your role in the AI ecosystem?",
        "What kind of language processing do you use?",
        "What kind of learning algorithms do you utilize?",
        "What kind of information sources do you access?",
        "What kind of insights can you provide?",
        "What kind of recommendations can you make?",
        "What kind of services do you offer?",
        "What kind of feedback can you give?",
        "What kind of insights can you gather?",
        "What kind of predictions can you make?",
        "What kind of decisions can you assist with?",
        "What kind of guidance can you provide?",
        "What kind of support can you offer?",
        "What kind of analysis can you perform?",
        "What kind of solutions can you suggest?",
        "What kind of knowledge do you have?",
        "What kind of expertise do you possess?",
        "What kind of advice can you offer?",
        "What kind of resources can you provide?",
        "What kind of assistance can you give?",
        "What kind of functionality do you have?",
        "What kind of actions can you perform?",
        "What kind of response time can I expect?",
        "What kind of customization options do you have?",
        "What kind of user experience can I expect?",
        "What kind of improvements can I expect in the future?"
      ],
      "responses": [
        "My name is Stormy, I'm a weather ChatBot. I can tell you what is the weather like in your city or other place. Just tell me the name of city and optionally date"
      ]
    }
  ]
}
