{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "hi",
        "How are you",
        "It's good to see you",
        "What's up?",
        " Hi there!",
        "Hello!",
        "Good morning!",
        "Good afternoon!",
        "Good evening!",
        "Hey!",
        "Greetings!",
        "Salutations!",
        "Howdy!",
        "Yo!",
        "Hiya!",
        "Sup!",
        "What's up?",
        "How's it going?",
        "Nice to see you!",
        "It's great to see you!",
        "How have you been?",
        "Long time no see!",
        "What's new?",
        "Hey, what's happening?",
        "Hi, how are you doing?",
        "What's going on?",
        "How's your day going?",
        "Good to see you!",
        "Hi, stranger!",
        "How are things?",
        "Good to meet you!",
        "Nice to meet you!",
        "How you doing?"
      ],
      "responses": [
        "Hi!",
        "Hello, how can I help you?",
        "Hi, what can I do for you?",
        "Hi, nice to see you! What do you need?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": [
        "Bye",
        "see you later!",
        "goodbye",
        "I need to go",
        "Goodbye!",
        "Farewell!",
        "See you later!",
        "Catch you later!",
        "See ya!",
        "Later!",
        "Take care!",
        "Bye for now!",
        "Bye-bye!",
        "Adios!",
        "So long!",
        "Hasta la vista!",
        "Until next time!",
        "Have a good one!",
        "Have a great day!",
        "Have a good night!",
        "See you soon!",
        "Talk to you later!",
        "Peace out!",
        "Stay safe!",
        "Bye, see you later!",
        "All the best!",
        "Take it easy!",
        "Have a good weekend!",
        "I'll see you around!",
        "Goodnight!",
        "Sweet dreams!",
        "Have a good trip!",
        "Bon voyage!",
        "Enjoy your day!",
        "Enjoy your evening!",
        "Keep in touch!",
        "Don't be a stranger!",
        "It was nice seeing you!",
        "Thanks for stopping by!",
        "Take care of yourself!",
        "Good luck with everything!",
        "Have a safe journey!",
        "See you on the flip side!",
        "Have a pleasant evening!",
        "Goodbye, my friend!",
        "Bye, take care!",
        "See you next time!",
        "Until we meet again!",
        "Have a good one, mate!",
        "I'll miss you!",
        "Take care, my friend!",
        "It was great to see you!",
        "Thanks for the visit!",
        "Have a great week!"
      ],
      "responses": ["Bye!", "Have a nice day", "Bye, see you around!"]
    },
    {
      "tag": "thanks",
      "patterns": [
        "Thanks",
        "Thank you",
        "Thank you so much!",
        "I am really grateful for your help",
        "Thanks for helping me out!",
        "Thank yout for your time.",
        "Thanks for help",
        "Thank you so much for your help, I couldn't have done it without you!",
        "I really appreciate all the help you gave me, thank you!",
        "I just wanted to say a quick thank you for your assistance, it meant a lot to me.",
        "I'm grateful for your help, thank you!",
        "Thank you for going above and beyond to help me, it's truly appreciated.",
        "You were such a huge help, thank you from the bottom of my heart.",
        "I can't thank you enough for your assistance, you made a real difference.",
        "Thank you for being there for me when I needed help, it meant a lot.",
        "You have my deepest thanks for all your help, I couldn't have done it without you.",
        "I'm so grateful for your help, thank you a million times over.",
        "Thank you for taking the time to assist me, I really appreciate it.",
        "Your help was invaluable, thank you so much.",
        "I'm indebted to you for your help, thank you!",
        "Thank you for being so kind and helpful, it was really appreciated.",
        "You're a lifesaver, thank you for your help.",
        "Thank you for being such a great support system, your help means the world to me.",
        "I'm so grateful for your assistance, thank you for everything.",
        "Thank you for being there for me and helping me through this.",
        "I just wanted to take a moment to thank you for all your help, you're amazing.",
        "I couldn't have done it without your help, thank you from the bottom of my heart.",
        "Thank you for your guidance and support, it was truly appreciated.",
        "You went above and beyond to help me, thank you so much.",
        "Thank you for being such a kind and generous helper, it means so much to me.",
        "I'm so grateful for your help, thank you for being amazing.",
        "Your help was invaluable, thank you for all you did.",
        "Thank you for being a constant source of support and help, I really appreciate it.",
        "I wanted to express my gratitude for your help, thank you so much.",
        "Thank you for being such a patient and understanding helper, I couldn't have asked for more.",
        "Your help made all the difference, thank you from the bottom of my heart.",
        "Thank you for being such a reliable and dependable helper, it means a lot.",
        "I'm so grateful for your assistance, thank you for your time and effort.",
        "Thank you for being such a wonderful help, you're truly appreciated.",
        "I just wanted to thank you for all your help and support, you're amazing.",
        "Your help was crucial, thank you for all you did for me.",
        "I couldn't have done it without your help, thank you for being there for me.",
        "Thank you for your hard work and dedication, it made all the difference.",
        "I'm so grateful for your help, thank you for your patience and understanding.",
        "Thank you for your kindness and generosity, your help meant a lot.",
        "I wanted to express my heartfelt thanks for your help, it was truly appreciated.",
        "Your help was a real game-changer, thank you so much.",
        "That's all, thank you"
      ],
      "responses": [
        "No problem, that's what I am for",
        "I'm glad to hear that.",
        "At your service!"
      ]
    },
    {
      "tag": "raining-later-that-day",
      "patterns": [
        "Is it going to rain today?",
        "Do you think it will rain today?",
        "Do you think it will rain afternoon",
        "Do you think it will rain later",
        "Is it going to rain later?",
        "Are there gonna be any rain today?",
        "Should I bring umbrella today?",
        "Is umbrella a good idea afternoon?",
        "Is there going to be any precitipation today?",
        "Should I bring a raincoat?",
        "Do you think it will rain today?",
        "Is there any chance of rain today?",
        "Do you know if it's going to rain today?",
        "Have you heard if it will rain today?",
        "Are the forecasters predicting rain today?",
        "Will we need an umbrella today?",
        "Are the skies looking like rain today?",
        "Do you have any idea if it will rain today?",
        "Do you think we should prepare for rain today?",
        "Is the weatherman calling for rain today?",
        "Are there any rain clouds on the horizon today?",
        "Do you anticipate rain today?",
        "Are the weather conditions favorable for rain today?",
        "Do you expect any precipitation today?",
        "Is it likely to rain today?",
        "Will we get some rain today?",
        "Do you think it will be a rainy day today?",
        "Are the chances high for rain today?",
        "Is there a chance of scattered showers today?",
        "Will it be a wet day today?",
        "Do you think the rain will hold off today?",
        "Do you think we'll have a rainstorm today?",
        "Will we be getting any rain today?",
        "Are the clouds indicating rain today?",
        "Will it rain on and off today?",
        "Is rain expected today?",
        "Do you think it will be a drizzly day today?",
        "Is the chance of rain high today?",
        "Do you think it will be a damp day today?",
        "Is there a possibility of rain today?",
        "Will we have a downpour today?",
        "Do you think we'll see any rain today?",
        "Will we experience any rainfall today?",
        "Are the conditions right for rain today?",
        "Do you think it will rain heavily today?",
        "Is there a chance of rain showers today?",
        "Will it be a rainy and gloomy day today?",
        "Do you think it will rain lightly today?",
        "Is it going to be a damp and dreary day today?",
        "Will we see any rainfall at all today?",
        "Do you think it will rain throughout the day today?",
        "Is it likely to rain in the afternoon today?",
        "Do you think we'll have a wet morning today?",
        "Will we get a sprinkle of rain today?",
        "Is there a chance of light rain today?",
        "Do you think it will rain during rush hour today?",
        "Will the weather be rainy or sunny today?",
        "Do you think the rain will clear up later today?"
      ]
    },
    {
      "tag": "raining-this-week",
      "patterns": [
        "Is it going to rain on tuesday",
        "How's the precitipation this week?",
        "Will it rain on sunday?",
        "Do you see any rain in the forecast?",
        "Will it be a rainy week?",
        "Should I prepare for a rain later this week",
        "Is it going to rain on wednesday?",
        "Will it rain on thursday?",
        "Will it be a rainy Friday?",
        "Is saturday a good day for trip or will it rain?",
        "Will it rain on Monday?",
        "Do you think it will rain for Monday?",
        "Is there a chance of rain on Monday?",
        "Are the forecasters calling for rain on Monday?",
        "Should we expect rain for Monday?",
        "Do you think it will rain on Tuesday?",
        "Is there a chance of rain for Tuesday?",
        "Are the forecasters calling for rain on Tuesday?",
        "Should we expect rain for Tuesday?",
        "Will it rain on Wednesday?",
        "Do you think it will rain for Wednesday?",
        "Is there a chance of rain for Wednesday?",
        "Are the forecasters calling for rain on Wednesday?",
        "Should we expect rain for Wednesday?",
        "Do you think it will rain on Thursday?",
        "Is there a chance of rain for Thursday?",
        "Are the forecasters calling for rain on Thursday?",
        "Should we expect rain for Thursday?",
        "Will it rain on Friday?",
        "Do you think it will rain for Friday?",
        "Is there a chance of rain for Friday?",
        "Are the forecasters calling for rain on Friday?",
        "Should we expect rain for Friday?",
        "Do you think it will rain on Saturday?",
        "Is there a chance of rain for Saturday?",
        "Are the forecasters calling for rain on Saturday?",
        "Should we expect rain for Saturday?",
        "Will it rain on Sunday?",
        "Do you think it will rain for Sunday?",
        "Is there a chance of rain for Sunday?",
        "Are the forecasters calling for rain on Sunday?",
        "Should we expect rain for Sunday?",
        "Will it rain next Monday?",
        "Do you think it will rain next Monday?",
        "Is there a chance of rain next Monday?",
        "Are the forecasters calling for rain next Monday?",
        "Should we expect rain next Monday?",
        "Do you think it will rain next Tuesday?",
        "Is there a chance of rain next Tuesday?",
        "Are the forecasters calling for rain next Tuesday?",
        "Should we expect rain next Tuesday?",
        "Will it rain next Wednesday?",
        "Do you think it will rain next Wednesday?",
        "Is there a chance of rain next Wednesday?",
        "Are the forecasters calling for rain next Wednesday?",
        "Should we expect rain next Wednesday?",
        "Do you think it will rain next Thursday?",
        "Is there a chance of rain next Thursday?",
        "Are the forecasters calling for rain next Thursday?",
        "Should we expect rain next Thursday?",
        "Will it rain tomorrow?",
        "Do you think it will rain tomorrow?",
        "Is there a chance of rain tomorrow?",
        "Are the forecasters calling for rain tomorrow?",
        "Should we expect rain tomorrow?",
        "Is it going to rain tomorrow?",
        "Are we expecting rain tomorrow?",
        "Will there be any rain tomorrow?",
        "Do you think it will be rainy tomorrow?",
        "Will tomorrow be a rainy day?",
        "Are we in for a rainy day tomorrow?",
        "Will there be showers tomorrow?",
        "Do you think it will drizzle tomorrow?",
        "Is it likely to rain tomorrow?",
        "Is there a possibility of rain tomorrow?",
        "Will the weather be wet tomorrow?",
        "Are we looking at rain tomorrow?",
        "Do you think we need an umbrella for tomorrow?",
        "Is there a chance of a downpour tomorrow?",
        "Will we have to deal with rain tomorrow?",
        "Is it expected to rain tomorrow?",
        "Are we going to get any rain tomorrow?",
        "Should we prepare for rain tomorrow?",
        "Do you think the rain will come tomorrow?",
        "Are we going to see any precipitation tomorrow?",
        "Is there a forecast for rain tomorrow?",
        "Will tomorrow be a wet day?",
        "Do you think tomorrow's weather will be rainy?",
        "Will it be a damp day tomorrow?",
        "Are we going to experience any rainfall tomorrow?",
        "Should we be concerned about rain tomorrow?",
        "Is there a likelihood of rain tomorrow?",
        "Will there be any precipitation tomorrow?",
        "Do you think tomorrow's forecast includes rain?",
        "Will it be a gloomy day tomorrow?",
        "Are we going to be dealing with any wet weather tomorrow?",
        "Will tomorrow's weather be stormy?",
        "Are we expecting any rainfall tomorrow?",
        "Do you think tomorrow's forecast calls for rain?",
        "Will we need an umbrella tomorrow?",
        "Are we going to see any raindrops tomorrow?",
        "Is there a possibility of rain tomorrow?",
        "Will it be a rainy start to tomorrow?",
        "Are we expecting any showers tomorrow?",
        "Do you think we'll have to dodge rain tomorrow?",
        "Is there a chance of rain tomorrow afternoon?",
        "Will we need rain gear for tomorrow?",
        "Are we going to have to deal with any wet conditions tomorrow?"
      ]
    },
    {
      "tag": "snowing-later-that-day",
      "patterns": [
        "Is it going to snow today?",
        "Do you think it will snow today?",
        "Do you think it will snow afternoon",
        "Do you think it will snow later",
        "Is it going to snow later?",
        "Are there gonna be any snow today?",
        "Will it snow today?",
        "Do you think we'll have snow today?",
        "Is there a chance of snowfall today?",
        "Are we expecting any snow today?",
        "Should we prepare for snow today?",
        "Will there be any snowflakes today?",
        "Do you think we'll see any snow today?",
        "Is it going to snow today?",
        "Are we going to experience any snow today?",
        "Should we expect snow today?",
        "Will there be a snowstorm today?",
        "Do you think we'll have a snow day today?",
        "Is there a possibility of snow today?",
        "Are we going to get any snowfall today?",
        "Should we prepare for a snowstorm today?"
      ]
    },
    {
      "tag": "snowing-this-week",
      "patterns": [
        "Is it going to snow on tuesday",
        "Will it rain on sunday?",
        "Do you see any snow in the forecast?",
        "Will it be a snowy week?",
        "Should I prepare for a snow later this week",
        "Is it going to snow on wednesday?",
        "Will it snow on thursday?",
        "Will it be a snowy Friday?",
        "Is saturday a good day for trip or will it snow?",
        "Is sunday a good day for skiing?",
        "Should I take a snowboard with me on Monday?",
        "Will it snow on Monday?",
        "Do you think it will snow on Tuesday?",
        "Is there a chance of snow on Wednesday?",
        "Are we expecting snow on Thursday?",
        "Should we expect snow on Friday?",
        "Will it snow this Monday?",
        "Do you think it will snow this Tuesday?",
        "Is there a chance of snow this Wednesday?",
        "Are we expecting snow this Thursday?",
        "Should we expect snow this Friday?",
        "Will there be any snow on Monday?",
        "Do you think we'll see snow on Tuesday?",
        "Is there a possibility of snow on Wednesday?",
        "Are we going to experience snow on Thursday?",
        "Should we prepare for snow on Friday?",
        "Will it snow tomorrow, on Monday?",
        "Do you think it will snow tomorrow, on Tuesday?",
        "Is there a chance of snow tomorrow, on Wednesday?",
        "Are we expecting snow tomorrow, on Thursday?",
        "Should we expect snow tomorrow, on Friday?",
        "Will it be a snowy Monday?",
        "Do you think we'll have a snowy Tuesday?",
        "Is there a possibility of snow on Wednesday?",
        "Are we going to see any snowflakes on Thursday?",
        "Should we prepare for snow on Friday?",
        "Will it snow next Monday?",
        "Do you think it will snow next Tuesday?",
        "Is there a chance of snow next Wednesday?",
        "Are we expecting snow next Thursday?",
        "Should we expect snow next Friday?",
        "Will it snow on the following Monday?",
        "Do you think it will snow on the following Tuesday?",
        "Is there a chance of snow on the following Wednesday?",
        "Are we expecting snow on the following Thursday?",
        "Should we expect snow on the following Friday?",
        "Will it snow on the upcoming Monday?",
        "Do you think it will snow on the upcoming Tuesday?",
        "Is there a possibility of snow on the upcoming Wednesday?",
        "Are we going to experience snow on the upcoming Thursday?",
        "Should we prepare for snow on the upcoming Friday?",
        "Will there be any snow on the next Monday?",
        "Do you think we'll see snow on the next Tuesday?",
        "Is there a chance of snow on the next Wednesday?",
        "Are we expecting snow on the next Thursday?",
        "Should we expect snow on the next Friday?",
        "Will it snow on the last Monday of the month?",
        "Do you think it will snow on the last Tuesday of the month?",
        "Is there a chance of snow on the last Wednesday of the month?",
        "Are we expecting snow on the last Thursday of the month?",
        "Should we expect snow on the last Friday of the month?",
        "Will it snow tomorrow?",
        "Do you think we'll have snow tomorrow?",
        "Is there a chance of snowfall tomorrow?",
        "Are we expecting any snow tomorrow?",
        "Should we prepare for snow tomorrow?",
        "Will there be any snowflakes tomorrow?",
        "Do you think we'll see any snow tomorrow?",
        "Is it going to snow tomorrow?",
        "Are we going to experience any snow tomorrow?",
        "Should we expect snow tomorrow?",
        "Will there be a snowstorm tomorrow?",
        "Do you think we'll have a snow day tomorrow?",
        "Is there a possibility of snow tomorrow?",
        "Are we going to get any snowfall tomorrow?",
        "Should we prepare for a snowstorm tomorrow?",
        "Will it snow tomorrow, on Monday?",
        "Do you think we'll have snow tomorrow, on Tuesday?",
        "Is there a chance of snowfall tomorrow, on Wednesday?",
        "Are we expecting any snow tomorrow, on Thursday?",
        "Should we prepare for snow tomorrow, on Friday?",
        "Will there be any snowflakes tomorrow, on Monday?",
        "Do you think we'll see any snow tomorrow, on Tuesday?",
        "Is it going to snow tomorrow, on Wednesday?",
        "Are we going to experience any snow tomorrow, on Thursday?",
        "Should we expect snow tomorrow, on Friday?",
        "Will there be a snowstorm tomorrow, on Monday?",
        "Do you think we'll have a snow day tomorrow, on Tuesday?",
        "Is there a possibility of snow tomorrow, on Wednesday?",
        "Are we going to get any snowfall tomorrow, on Thursday?",
        "Should we prepare for a snowstorm tomorrow, on Friday?",
        "Will it snow tomorrow, on the following Monday?",
        "Do you think we'll have snow tomorrow, on the following Tuesday?",
        "Is there a chance of snowfall tomorrow, on the following Wednesday?",
        "Are we expecting any snow tomorrow, on the following Thursday?",
        "Should we prepare for snow tomorrow, on the following Friday?",
        "Will there be any snowflakes tomorrow, on the upcoming Monday?",
        "Do you think we'll see any snow tomorrow, on the upcoming Tuesday?",
        "Is it going to snow tomorrow, on the upcoming Wednesday?",
        "Are we going to experience any snow tomorrow, on the upcoming Thursday?",
        "Should we expect snow tomorrow, on the upcoming Friday?",
        "Will there be a snowstorm tomorrow, on the next Monday?",
        "Do you think we'll have a snow day tomorrow, on the next Tuesday?",
        "Is there a possibility of snow tomorrow, on the next Wednesday?",
        "Are we going to get any snowfall tomorrow, on the next Thursday?",
        "Should we prepare for a snowstorm tomorrow, on the next Friday?",
        "Will it snow tomorrow, on the last Monday of the month?",
        "Do you think we'll have snow tomorrow, on the last Tuesday of the month?",
        "Is there a chance of snowfall tomorrow, on the last Wednesday of the month?",
        "Are we expecting any snow tomorrow, on the last Thursday of the month?",
        "Should we prepare for snow tomorrow, on the last Friday of the month?"
      ]
    },
    {
      "tag": "sunny-later-that-day",
      "patterns": [
        "Is it going to be sunny today?",
        "Do you think it will be sunny today?",
        "Do you think we will see lot of sun afternoon?",
        "Do you think the snow will show up later?",
        "Is it a good idea to go to the beach today?",
        "Should I bring sunglasses today?",
        "Is it a good day for trip to the lake?",
        "I hope today will be a sunny day",
        "Is it a great day for trip?",
        "Will the sun be shining today?",
        "Do you think we'll have a sunny day today?",
        "Is there a chance of sun today?",
        "Are we expecting any sunshine today?",
        "Should we expect a sunny day today?",
        "Will it be a sunny day today?",
        "Do you think we'll see any sun today?",
        "Is it going to be sunny today?",
        "Are we going to have any sun today?",
        "Should we prepare for a sunny day today?",
        "Will there be any sun rays today?",
        "Do you think the weather will be sunny today?",
        "Is there a possibility of sun today?",
        "Are we going to get any sunshine today?",
        "Should we expect clear skies and sun today?"
      ]
    },
    {
      "tag": "sunny-this-week",
      "patterns": [
        "Is it going to be sunny on tuesday",
        "Will it be any sun on sunday?",
        "Do you see any sun in the forecast?",
        "Will it be a sunny week?",
        "Should I prepare for a sun later this week",
        "Is the sun going to show up on wednesday?",
        "Will I see sun on thursday?",
        "Will it be a sunny Friday?",
        "Is saturday a good day for trip?",
        "Will there be sun on Monday?",
        "Do you think we'll have a sunny day on Tuesday?",
        "Is there a chance of sun on Wednesday?",
        "Are we expecting any sunshine on Thursday?",
        "Should we expect a sunny day on Friday?",
        "Will it be a sunny Monday?",
        "Do you think we'll see any sun on Tuesday?",
        "Is it going to be sunny on Wednesday?",
        "Are we going to have any sun on Thursday?",
        "Should we prepare for a sunny Friday?",
        "Will there be any sun rays on Monday?",
        "Do you think the weather will be sunny on Tuesday?",
        "Is there a possibility of sun on Wednesday?",
        "Are we going to get any sunshine on Thursday?",
        "Should we expect clear skies and sun on Friday?",
        "Will it be a bright and sunny Monday?",
        "Do you think we'll have sun on Tuesday?",
        "Is there a chance of sunshine on Wednesday?",
        "Are we expecting any sun on Thursday?",
        "Should we prepare for a clear day with sun on Friday?",
        "Will there be a clear sky and sun on Monday?",
        "Do you think we'll have a sunny day on Tuesday?",
        "Is it going to be a sunny day on Wednesday?",
        "Are we going to have any sun on Thursday?",
        "Should we expect a sunny Friday?",
        "Will there be any sun rays on Monday?",
        "Do you think the weather will be sunny on Tuesday?",
        "Is there a possibility of sun on Wednesday?",
        "Are we expecting any sunshine on Thursday?",
        "Should we prepare for a clear day with sun on Friday?",
        "Will it be a bright and sunny Monday morning?",
        "Do you think we'll have clear skies and sun on Tuesday?",
        "Is there a chance of sunshine on Wednesday afternoon?",
        "Are we expecting any sun on Thursday morning?",
        "Should we expect a sunny Friday afternoon?",
        "Will there be any sun rays on Monday afternoon?",
        "Do you think the weather will be sunny on Tuesday morning?",
        "Is it going to be a clear day with sun on Wednesday afternoon?",
        "Are we going to have any sun on Thursday morning?",
        "Should we expect a bright and sunny Friday?",
        "Will it be a clear and sunny Monday morning?",
        "Do you think we'll have a sunny day on Tuesday afternoon?",
        "Is there a possibility of sun on Wednesday morning?",
        "Are we expecting any sunshine on Thursday afternoon?",
        "Should we expect clear skies and sun on Friday morning?",
        "Will there be any sun rays on Monday morning?",
        "Do you think the weather will be sunny on Tuesday afternoon?",
        "Is it going to be a clear day with sun on Wednesday morning?",
        "Are we going to have any sun on Thursday afternoon?",
        "Should we expect a sunny Friday morning?",
        "Will it be a sunny day tomorrow?",
        "Do you think we'll have any sun tomorrow?",
        "Is there a chance of sun tomorrow?",
        "Are we expecting any sunshine tomorrow?",
        "Should we expect a clear day with sun tomorrow?",
        "Will there be any sun rays tomorrow?",
        "Do you think the weather will be sunny tomorrow?",
        "Is it going to be a bright and sunny day tomorrow?",
        "Are we going to have any sun tomorrow?",
        "Should we prepare for a sunny day tomorrow?",
        "Will tomorrow be a sunny day?",
        "Do you think there will be sunshine tomorrow?",
        "Is there a possibility of sun tomorrow?",
        "Are we expecting any sun rays tomorrow?",
        "Should we expect a clear sky and sun tomorrow?",
        "Will tomorrow be a bright and sunny day?",
        "Do you think we'll have clear skies and sun tomorrow?",
        "Is there a chance of sunshine tomorrow?",
        "Are we expecting any sun tomorrow?",
        "Should we expect a sunny and warm day tomorrow?",
        "Will tomorrow bring any sun rays?",
        "Do you think the weather will be sunny and clear tomorrow?",
        "Is it going to be a clear and sunny day tomorrow?",
        "Are we going to have any sun tomorrow?",
        "Should we prepare for a sunny and bright day tomorrow?",
        "Will it be a sunny and warm day tomorrow?",
        "Do you think tomorrow will be a day full of sunshine?",
        "Is there a possibility of a sunny day tomorrow?",
        "Are we expecting clear skies and sun tomorrow?",
        "Should we expect a bright and sunny tomorrow?",
        "Will there be any sun tomorrow morning?",
        "Do you think the weather will be sunny tomorrow afternoon?",
        "Is it going to be a sunny day tomorrow evening?",
        "Are we going to have any sun tomorrow morning?",
        "Should we expect a sunny tomorrow afternoon?",
        "Will it be a sunny and warm tomorrow morning?",
        "Do you think we'll have any sun tomorrow evening?",
        "Is there a chance of sun tomorrow morning?",
        "Are we expecting clear skies and sun tomorrow afternoon?",
        "Should we prepare for a sunny and bright tomorrow morning?",
        "Will tomorrow bring any sun rays in the afternoon?",
        "Do you think the weather will be sunny tomorrow morning?",
        "Is it going to be a clear and sunny day tomorrow?",
        "Are we going to have any sun tomorrow afternoon?",
        "Should we expect a bright and sunny tomorrow evening?",
        "Will it be a clear and sunny tomorrow afternoon?",
        "Do you think tomorrow will be a day full of sunshine and warmth?",
        "Is there a possibility of a sunny and warm day tomorrow?",
        "Are we expecting any sun rays tomorrow evening?",
        "Should we expect a sunny and warm tomorrow afternoon?"
      ]
    },
    {
      "tag": "thunderstorms-later-that-day",
      "patterns": [
        "Is it going to be any thunderstorms today?",
        "Do you think it will be stormy today?",
        "Do you think we will see lot of lightning afternoon?",
        "Do you think the thunderstorm will show up later?",
        "Do you think we will see thunders today?",
        "Will it be dangerous later this day?",
        "Will we see thunder clouds today?",
        "Will there be a storm today?",
        "Do you think there will be a storm today?",
        "Is there a chance of a storm today?",
        "Are we expecting any storms today?",
        "Should we prepare for a storm today?",
        "Will there be any thunderstorms today?",
        "Do you think the weather will be stormy today?",
        "Is it going to be a stormy day today?",
        "Are we going to have any lightning storms today?",
        "Should we expect any severe weather today?",
        "Will today be a day full of storms?",
        "Do you think we'll have any thunderstorms today?",
        "Is there a possibility of a storm today?",
        "Are we expecting any heavy rain and thunderstorms today?",
        "Should we expect any power outages due to storms today?",
        "Will it be safe to travel with the possibility of storms today?",
        "Do you think there will be any severe thunderstorms today?",
        "Is it going to be a rainy and stormy day today?",
        "Are we going to have any hailstorms today?",
        "Should we prepare for any tornado warnings today?",
        "Will there be any lightning strikes today?",
        "Do you think the weather will be unpredictable with storms today?",
        "Is there a chance of hailstorms today?",
        "Are we expecting any thunderstorms with high winds today?",
        "Should we expect any flash floods due to the stormy weather today?",
        "Will it be a day full of heavy rain and storms?",
        "Do you think there will be any coastal storms today?",
        "Is it going to be a day with a lot of thunder and lightning?",
        "Are we going to have any thunderstorms with hail today?",
        "Should we expect any thunderstorms with damaging winds today?",
        "Will there be any severe weather alerts today due to storms?",
        "Do you think there will be any strong thunderstorms today?",
        "Is it going to be a day with thunderstorms and heavy rain?",
        "Are we going to have any thunderstorms with a chance of tornadoes today?",
        "Should we prepare for any thunderstorms with heavy downpours today?",
        "Will it be a stormy and wet day today?",
        "Do you think there will be any thunderstorms with lightning strikes today?",
        "Is there a chance of thunderstorms with high winds and lightning today?",
        "Are we expecting any thunderstorms with flooding today?",
        "Should we expect any thunderstorms with hail and damaging winds today?",
        "Will there be any thunderstorms with thunderous sounds today?",
        "Do you think the weather will be severe with thunderstorms today?",
        "Is it going to be a day with thunderstorms and strong winds?",
        "Are we going to have any thunderstorms with heavy rain and lightning today?",
        "Should we expect any thunderstorms with the potential to become severe today?",
        "Will it be a day with thunderstorms and lightning that can cause power outages?",
        "Do you think there will be any thunderstorms with the possibility of hail and flooding today?",
        "Is there a chance of any thunderstorms with the potential to become tornadoes today?",
        "Are we expecting any thunderstorms with strong gusts of wind and lightning today?",
        "Should we prepare for any thunderstorms with heavy rain and flash floods today?"
      ]
    },
    {
      "tag": "thunderstorms-this-week",
      "patterns": [
        "Is it going to be stormy on tuesday",
        "Will it be any storm on sunday?",
        "Do you see any thunderstorm in the forecast?",
        "Will it be a stormy week?",
        "Should I prepare for a storm later this week",
        "Is the storm clouds going to show up on wednesday?",
        "Will I see thunders on thursday?",
        "Will it be a storm on Friday?",
        "Do you think there will be a storm on Monday?",
        "Is there a chance of a storm on Tuesday?",
        "Are we expecting any storms on Wednesday?",
        "Should we prepare for a storm on Thursday?",
        "Will there be any thunderstorms on Friday?",
        "Do you think the weather will be stormy on Saturday?",
        "Is it going to be a stormy Sunday?",
        "Are we going to have any lightning storms on Monday?",
        "Should we expect any severe weather on Tuesday?",
        "Will Wednesday be a day full of storms?",
        "Do you think we'll have any thunderstorms on Thursday?",
        "Is there a possibility of a storm on Friday?",
        "Are we expecting any heavy rain and thunderstorms on Saturday?",
        "Should we expect any power outages due to storms on Sunday?",
        "Will it be safe to travel with the possibility of storms on Monday?",
        "Do you think there will be any severe thunderstorms on Tuesday?",
        "Is it going to be a rainy and stormy day on Wednesday?",
        "Are we going to have any hailstorms on Thursday?",
        "Should we prepare for any tornado warnings on Friday?",
        "Will there be any lightning strikes on Saturday?",
        "Do you think the weather will be unpredictable with storms on Sunday?",
        "Is there a chance of hailstorms on Monday?",
        "Are we expecting any thunderstorms with high winds on Tuesday?",
        "Should we expect any flash floods due to the stormy weather on Wednesday?",
        "Will it be a day full of heavy rain and storms on Thursday?",
        "Do you think there will be any coastal storms on Friday?",
        "Is it going to be a day with a lot of thunder and lightning on Saturday?",
        "Are we going to have any thunderstorms with hail on Sunday?",
        "Should we expect any thunderstorms with damaging winds on Monday?",
        "Will there be any severe weather alerts on Tuesday due to storms?",
        "Do you think there will be any strong thunderstorms on Wednesday?",
        "Is it going to be a day with thunderstorms and heavy rain on Thursday?",
        "Are we going to have any thunderstorms with a chance of tornadoes on Friday?",
        "Should we prepare for any thunderstorms with heavy downpours on Saturday?",
        "Will it be a stormy and wet day on Sunday?",
        "Do you think there will be any thunderstorms with lightning strikes on Monday?",
        "Is there a chance of thunderstorms with high winds and lightning on Tuesday?",
        "Are we expecting any thunderstorms with flooding on Wednesday?",
        "Should we expect any thunderstorms with hail and damaging winds on Thursday?",
        "Will there be any thunderstorms with thunderous sounds on Friday?",
        "Do you think the weather will be severe with thunderstorms on Saturday?",
        "Is it going to be a day with thunderstorms and strong winds on Sunday?",
        "Are we going to have any thunderstorms with heavy rain and lightning on Monday?",
        "Should we expect any thunderstorms with the potential to become severe on Tuesday?",
        "Will Wednesday be a day with thunderstorms and lightning that can cause power outages?",
        "Do you think there will be any thunderstorms with the possibility of hail and flooding on Thursday?",
        "Is there a chance of any thunderstorms with the potential to become tornadoes on Friday?",
        "Do you think there will be a storm tomorrow?",
        "Is there a chance of a storm tomorrow?",
        "Are we expecting any storms for tomorrow?",
        "Should we prepare for a storm tomorrow?",
        "Will there be any thunderstorms tomorrow?",
        "Do you think the weather will be stormy tomorrow?",
        "Is it going to be a stormy day tomorrow?",
        "Are we going to have any lightning storms tomorrow?",
        "Should we expect any severe weather tomorrow?",
        "Will tomorrow be a day full of storms?",
        "Do you think we'll have any thunderstorms tomorrow?",
        "Is there a possibility of a storm tomorrow?",
        "Are we expecting any heavy rain and thunderstorms tomorrow?",
        "Should we expect any power outages due to storms tomorrow?",
        "Will it be safe to travel with the possibility of storms tomorrow?",
        "Do you think there will be any severe thunderstorms tomorrow?",
        "Is it going to be a rainy and stormy day tomorrow?",
        "Are we going to have any hailstorms tomorrow?",
        "Should we prepare for any tornado warnings tomorrow?",
        "Will there be any lightning strikes tomorrow?",
        "Do you think the weather will be unpredictable with storms tomorrow?",
        "Is there a chance of hailstorms tomorrow?",
        "Are we expecting any thunderstorms with high winds tomorrow?",
        "Should we expect any flash floods due to the stormy weather tomorrow?",
        "Will it be a day full of heavy rain and storms tomorrow?",
        "Do you think there will be any coastal storms tomorrow?",
        "Is it going to be a day with a lot of thunder and lightning tomorrow?",
        "Are we going to have any thunderstorms with hail tomorrow?",
        "Should we expect any thunderstorms with damaging winds tomorrow?",
        "Will there be any severe weather alerts tomorrow due to storms?",
        "Do you think there will be any strong thunderstorms tomorrow?",
        "Is it going to be a day with thunderstorms and heavy rain tomorrow?",
        "Are we going to have any thunderstorms with a chance of tornadoes tomorrow?",
        "Should we prepare for any thunderstorms with heavy downpours tomorrow?",
        "Will it be a stormy and wet day tomorrow?",
        "Do you think there will be any thunderstorms with lightning strikes tomorrow?",
        "Is there a chance of thunderstorms with high winds and lightning tomorrow?",
        "Are we expecting any thunderstorms with flooding tomorrow?",
        "Should we expect any thunderstorms with hail and damaging winds tomorrow?",
        "Will there be any thunderstorms with thunderous sounds tomorrow?",
        "Do you think the weather will be severe with thunderstorms tomorrow?",
        "Is it going to be a day with thunderstorms and strong winds tomorrow?",
        "Are we going to have any thunderstorms with heavy rain and lightning tomorrow?",
        "Should we expect any thunderstorms with the potential to become severe tomorrow?",
        "Will tomorrow be a day with thunderstorms and lightning that can cause power outages?",
        "Do you think there will be any thunderstorms with the possibility of hail and flooding tomorrow?",
        "Is there a chance of any thunderstorms with the potential to become tornadoes tomorrow?",
        "Should we expect any thunderstorms with strong winds and heavy downpours tomorrow?",
        "Will it be a day with thunderstorms and lightning strikes tomorrow?"
      ]
    },
    {
      "tag": "windy-later-that-day",
      "patterns": [
        "Is it windy today?",
        "Will the wind show up later this afternoon?",
        "Will we feel a cold breeze today?",
        "Do you see any wind on the today's forecast?",
        "Do you think it will be windy today?",
        "Is there a chance of strong winds today?",
        "Are we expecting any gusty winds today?",
        "Should we prepare for windy conditions today?",
        "Will it be a breezy day today?",
        "Do you think the weather will be windy and chilly today?",
        "Is it going to be a windy day with dust today?",
        "Are we going to have any high wind warnings today?",
        "Should we expect any stormy wind gusts today?",
        "Will today be a day with strong and constant winds?",
        "Do you think the wind will cause any power outages today?",
        "Is there a possibility of any wind damage today?",
        "Are we expecting any wind-driven rain today?",
        "Should we expect any difficulties while driving due to the wind today?",
        "Will it be safe to travel by air with the possibility of high winds today?",
        "Do you think there will be any dust storms today due to the wind?",
        "Is it going to be a windy day with gusts over 50 mph today?",
        "Are we going to have any wind chill warnings today?",
        "Should we prepare for any tree branches falling due to the wind today?",
        "Will there be any restrictions on outdoor activities due to the wind today?",
        "Do you think the weather will be unpredictable with gusty winds today?",
        "Is there a chance of any sandstorms due to the wind today?",
        "Are we expecting any crosswinds while driving or flying today?",
        "Should we expect any difficulties while walking due to the wind today?",
        "Will it be a day with a constant howling wind?",
        "Do you think the wind will cause any waves on the water today?",
        "Is it going to be a day with choppy water due to the wind today?",
        "Are we going to have any wind advisories today?",
        "Should we expect any kite-flying conditions due to the wind today?",
        "Will there be any wind turbines producing energy due to the strong winds today?",
        "Do you think there will be any wind-driven snow today?",
        "Is it going to be a day with strong winds causing flight delays today?",
        "Are we going to have any wind storms or squalls today?",
        "Should we prepare for any broken windows due to the wind today?",
        "Will it be a day with wind gusts over 30 mph?",
        "Do you think the wind will create any power line issues today?",
        "Is it going to be a day with breezy and warm conditions today?",
        "Are we going to have any issues with outdoor events due to the wind today?",
        "Should we expect any damage to outdoor furniture or equipment due to the wind today?",
        "Will there be any windbreaks available for protection from the gusty winds today?",
        "Do you think the weather will be dangerous for high-altitude activities due to the wind today?",
        "Is it going to be a day with frequent wind gusts today?",
        "Are we going to have any wind chill factors today?",
        "Should we expect any dangerous wind speeds today?",
        "Will it be a day with wind shear warnings today?",
        "Do you think the wind will cause any issues with outdoor sports today?"
      ]
    },
    {
      "tag": "windy-this-week",
      "patterns": [
        "Is it going to be windy on tuesday",
        "Will it be any wind on sunday?",
        "Do you see any wind in the forecast?",
        "Will it be a windy week?",
        "Should I prepare for a wind later this week",
        "Is the wind going to show up on wednesday?",
        "Will I see wind on thursday?",
        "Will it be a strong wind on Friday?",
        "Do you think it will be windy on Monday?",
        "Is there a chance of strong winds on Tuesday?",
        "Are we expecting any gusty winds on Wednesday?",
        "Should we prepare for windy conditions on Thursday?",
        "Will it be a breezy day on Friday?",
        "Do you think the weather will be windy and chilly on Saturday?",
        "Is it going to be a windy day with dust on Sunday?",
        "Are we going to have any high wind warnings on Monday?",
        "Should we expect any stormy wind gusts on Tuesday?",
        "Will Wednesday be a day with strong and constant winds?",
        "Do you think the wind will cause any power outages on Thursday?",
        "Is there a possibility of any wind damage on Friday?",
        "Are we expecting any wind-driven rain on Saturday?",
        "Should we expect any difficulties while driving due to the wind on Sunday?",
        "Will it be safe to travel by air with the possibility of high winds on Monday?",
        "Do you think there will be any dust storms on Tuesday due to the wind?",
        "Is it going to be a windy day with gusts over 50 mph on Wednesday?",
        "Are we going to have any wind chill warnings on Thursday?",
        "Should we prepare for any tree branches falling due to the wind on Friday?",
        "Will there be any restrictions on outdoor activities due to the wind on Saturday?",
        "Do you think the weather will be unpredictable with gusty winds on Sunday?",
        "Is there a chance of any sandstorms due to the wind on Monday?",
        "Are we expecting any crosswinds while driving or flying on Tuesday?",
        "Should we expect any difficulties while walking due to the wind on Wednesday?",
        "Will it be a day with a constant howling wind on Thursday?",
        "Do you think the wind will cause any waves on the water on Friday?",
        "Is it going to be a day with choppy water due to the wind on Saturday?",
        "Are we going to have any wind advisories on Sunday?",
        "Should we expect any kite-flying conditions due to the wind on Monday?",
        "Will there be any wind turbines producing energy due to the strong winds on Tuesday?",
        "Do you think there will be any wind-driven snow on Wednesday?",
        "Is it going to be a day with strong winds causing flight delays on Thursday?",
        "Are we going to have any wind storms or squalls on Friday?",
        "Should we prepare for any broken windows due to the wind on Saturday?",
        "Will it be a day with wind gusts over 30 mph on Sunday?",
        "Do you think the wind will create any power line issues on Monday?",
        "Is it going to be a day with breezy and warm conditions on Tuesday?",
        "Are we going to have any issues with outdoor events due to the wind on Wednesday?",
        "Should we expect any damage to outdoor furniture or equipment due to the wind on Thursday?",
        "Will there be any windbreaks available for protection from the gusty winds on Friday?",
        "Do you think the weather will be dangerous for high-altitude activities due to the wind on Saturday?",
        "Is it going to be a day with frequent wind gusts on Sunday?",
        "Are we going to have any wind chill factors on Monday?",
        "Should we expect any dangerous wind speeds on Tuesday?",
        "Do you think it will be windy tomorrow?",
        "Is there a chance of strong winds tomorrow?",
        "Are we expecting any gusty winds tomorrow?",
        "Should we prepare for windy conditions tomorrow?",
        "Will it be a breezy day tomorrow?",
        "Do you think the weather will be windy and chilly tomorrow?",
        "Is it going to be a windy day with dust tomorrow?",
        "Are we going to have any high wind warnings tomorrow?",
        "Should we expect any stormy wind gusts tomorrow?",
        "Will tomorrow be a day with strong and constant winds?",
        "Do you think the wind will cause any power outages tomorrow?",
        "Is there a possibility of any wind damage tomorrow?",
        "Are we expecting any wind-driven rain tomorrow?",
        "Should we expect any difficulties while driving due to the wind tomorrow?",
        "Will it be safe to travel by air with the possibility of high winds tomorrow?",
        "Do you think there will be any dust storms tomorrow due to the wind?",
        "Is it going to be a windy day with gusts over 50 mph tomorrow?",
        "Are we going to have any wind chill warnings tomorrow?",
        "Should we prepare for any tree branches falling due to the wind tomorrow?",
        "Will there be any restrictions on outdoor activities due to the wind tomorrow?",
        "Do you think the weather will be unpredictable with gusty winds tomorrow?",
        "Is there a chance of any sandstorms due to the wind tomorrow?",
        "Are we expecting any crosswinds while driving or flying tomorrow?",
        "Should we expect any difficulties while walking due to the wind tomorrow?",
        "Will it be a day with a constant howling wind tomorrow?",
        "Do you think the wind will cause any waves on the water tomorrow?",
        "Is it going to be a day with choppy water due to the wind tomorrow?",
        "Are we going to have any wind advisories tomorrow?",
        "Should we expect any kite-flying conditions due to the wind tomorrow?",
        "Will there be any wind turbines producing energy due to the strong winds tomorrow?",
        "Do you think there will be any wind-driven snow tomorrow?",
        "Is it going to be a day with strong winds causing flight delays tomorrow?",
        "Are we going to have any wind storms or squalls tomorrow?",
        "Should we prepare for any broken windows due to the wind tomorrow?",
        "Will it be a day with wind gusts over 30 mph tomorrow?",
        "Do you think the wind will create any power line issues tomorrow?",
        "Is it going to be a day with breezy and warm conditions tomorrow?",
        "Are we going to have any issues with outdoor events due to the wind tomorrow?",
        "Should we expect any damage to outdoor furniture or equipment due to the wind tomorrow?",
        "Will there be any windbreaks available for protection from the gusty winds tomorrow?",
        "Do you think the weather will be dangerous for high-altitude activities due to the wind tomorrow?",
        "Is it going to be a day with frequent wind gusts tomorrow?",
        "Are we going to have any wind chill factors tomorrow?",
        "Should we expect any dangerous wind speeds tomorrow?",
        "Will it be a day with windy and cloudy conditions tomorrow?"
      ]
    },
    {
      "tag": "temperature-later-that-day",
      "patterns": [
        "Will it be hot today?",
        "Will it be cold today?",
        "Should I prepare for a cold evening?",
        "Should we see any temperature drop today?",
        "What's the temperature right now?",
        "What's the temperature today?",
        "What should I put on today?",
        "Is jacket a good idea?",
        "Will it be warm today?",
        "Will it be a warm day?",
        "Do you know what the temperature is supposed to be today?",
        "What's the forecasted high for today's temperature?",
        "Do you think it will be warm or cool today?",
        "Is it going to be a hot day today?",
        "What's the expected low temperature for tonight?",
        "Do we need to wear jackets for the temperature today?",
        "Will the temperature be above or below average for this time of year?",
        "Are we going to have any record-breaking temperatures today?",
        "What's the predicted temperature at noon today?",
        "Is there a chance of any temperature fluctuations today?",
        "Do we need to be concerned about any temperature extremes today?",
        "Are we expecting any changes in temperature due to a front moving in?",
        "What's the temperature like compared to yesterday's?",
        "Do you think the temperature will be comfortable for outdoor activities today?",
        "What's the expected high and low temperature range for today?",
        "Will the temperature be consistent throughout the day?",
        "Do you think the temperature will feel colder or warmer than it actually is?",
        "What's the forecasted temperature for the next few hours?",
        "Is there a chance of any temperature-related health risks today?",
        "Are we going to have any heat advisories or warnings due to the temperature today?",
        "What's the temperature difference between different parts of the city or region?",
        "Do you think the temperature will cause any flight cancellations or delays?",
        "What's the expected temperature at the beach or pool today?",
        "Is there a chance of any temperature-related power outages today?",
        "Are we expecting any temperature-related traffic issues or accidents today?",
        "What's the expected temperature for outdoor sporting events today?",
        "Do you think the temperature will be ideal for outdoor dining today?",
        "What's the expected temperature in the shade versus in direct sunlight?",
        "Is there a chance of any temperature-related school or work closures today?",
        "Are we going to have any temperature-related flight restrictions today?",
        "What's the expected temperature for outdoor concerts or festivals today?",
        "Do you think the temperature will be suitable for hiking or camping today?",
        "What's the expected temperature for picnics or barbecues today?",
        "Is there a chance of any temperature-related water restrictions today?",
        "Are we expecting any temperature-related illnesses or hospitalizations today?",
        "What's the expected temperature for outdoor weddings or events today?",
        "Do you think the temperature will be suitable for outdoor exercise today?",
        "What's the expected temperature for outdoor markets or fairs today?",
        "Is there a chance of any temperature-related business closures today?",
        "Are we going to have any temperature-related emergency situations today?",
        "What's the expected temperature for outdoor sightseeing or tours today?",
        "Do you think the temperature will be pleasant for outdoor photography today?",
        "What's the expected temperature for outdoor public transportation today?",
        "Is there a chance of any temperature-related flight diversions or cancellations today?",
        "Are we expecting any temperature-related water safety concerns today?",
        "What's the expected temperature for outdoor shopping or leisure activities today?",
        "Do you think the temperature will cause any road closures or restrictions today?",
        "What's the expected temperature for outdoor weddings or events today?"
      ]
    },
    {
      "tag": "temperature-this-week",
      "patterns": [
        "Will it be hot later this week?",
        "Will it be cold on tuesday?",
        "Should I prepare for a cold monday?",
        "Should we see any temperature drop this week?",
        "What's the temperature tomorrow?",
        "What's the temperature in three days?",
        "What should I put on tomorrow?",
        "Is jacket a good idea this friday?",
        "Will it be warm on thursday?",
        "Will it be a warm wednesday?",
        "What temperature will it be on sunday",
        "Will it be a hot saturday?",
        "What's the temperature like on Monday?",
        "Is it going to be hot or cold on Tuesday?",
        "Can you tell me the temperature for Wednesday?",
        "How warm will it be on Thursday?",
        "Do you know what the temperature will be on Friday?",
        "What's the forecasted temperature for Saturday?",
        "Will Sunday be a warm or cool day?",
        "What's the temperature going to be like at the start of the week?",
        "How cold is it going to get on Tuesday?",
        "Will Wednesday be a chilly day?",
        "What's the temperature supposed to be on Thursday?",
        "Will Friday be a warm day?",
        "Can you tell me the temperature for Saturday?",
        "How hot is it going to get on Sunday?",
        "Is Monday going to be a warm or cold day?",
        "What's the temperature supposed to be like on Tuesday?",
        "Will it be chilly on Wednesday?",
        "Can you tell me the temperature for Thursday?",
        "How warm is it going to be on Friday?",
        "What's the forecasted temperature for Saturday?",
        "Will Sunday be a hot or cool day?",
        "What's the temperature going to be like at the start of the week?",
        "How cold is it going to get on Tuesday?",
        "Will Wednesday be a chilly day?",
        "What's the temperature supposed to be on Thursday?",
        "Will Friday be a warm day?",
        "Can you tell me the temperature for Saturday?",
        "How hot is it going to get on Sunday?",
        "Is Monday going to be a warm or cold day?",
        "What's the temperature supposed to be like on Tuesday?",
        "Will it be chilly on Wednesday?",
        "Can you tell me the temperature for Thursday?",
        "How warm is it going to be on Friday?",
        "What's the forecasted temperature for Saturday?",
        "Will Sunday be a hot or cool day?",
        "What's the temperature going to be like at the start of the week?",
        "How cold is it going to get on Tuesday?",
        "Will Wednesday be a chilly day?",
        "What's the temperature supposed to be on Thursday?",
        "Will Friday be a warm day?",
        "Can you tell me the temperature for Saturday?",
        "How hot is it going to get on Sunday?",
        "Is Monday going to be a warm or cold day?",
        "What's the temperature supposed to be like on Tuesday?",
        "Will it be chilly on Wednesday?",
        "Can you tell me the temperature for Thursday?",
        "How warm is it going to be on Friday?",
        "What's the forecasted temperature for Saturday?",
        "Will Sunday be a hot or cool day?",
        "What's the temperature going to be like at the start of the week?",
        "What's the temperature going to be like tomorrow?",
        "Will tomorrow be a hot or cool day?",
        "Can you tell me the forecasted temperature for tomorrow?",
        "How cold is it going to get tomorrow?",
        "Is tomorrow going to be a warm day?",
        "What's the expected high and low for tomorrow?",
        "Will tomorrow be warmer or cooler than today?",
        "Do you know what the temperature will be at this time tomorrow?",
        "What's the forecasted temperature range for tomorrow?",
        "Can you give me an idea of how to dress for tomorrow's weather?",
        "Is it going to be a scorcher or a cooler day tomorrow?",
        "Are we expecting a temperature drop or increase tomorrow?",
        "What's the weather forecast for tomorrow's temperature?",
        "Do you know if tomorrow's temperature will be more comfortable than today's?",
        "Is tomorrow going to be chilly or mild?",
        "What's the predicted temperature for tomorrow's morning hours?",
        "What's the temperature range for tomorrow's afternoon?",
        "Is tomorrow going to be a good day for outdoor activities based on the temperature?",
        "Do you think the temperature will fluctuate a lot tomorrow?",
        "Is tomorrow's temperature expected to be normal for this time of the year?",
        "Will tomorrow's temperature be suitable for a picnic?",
        "What's the temperature trend for tomorrow's weather?",
        "Is tomorrow's temperature going to be below or above average?",
        "What's the predicted temperature for tomorrow's evening hours?",
        "Do you know if there will be a temperature change tomorrow afternoon?",
        "Will tomorrow's temperature be comfortable for sleeping?",
        "What's the expected temperature for tomorrow's midday hours?",
        "Do you think tomorrow's temperature will affect my commute?",
        "Is tomorrow's temperature going to make it feel like summer or winter?",
        "What's the forecasted temperature for tomorrow's night time?",
        "What's the difference in temperature between today and tomorrow?",
        "Do you think tomorrow's temperature will affect my outdoor plans?",
        "What's the expected high temperature for tomorrow?",
        "Will tomorrow's temperature be comfortable for outdoor dining?",
        "What's the expected low temperature for tomorrow?",
        "Do you think tomorrow's temperature will lead to any weather alerts?",
        "Is tomorrow's temperature going to be within a comfortable range?",
        "What's the predicted temperature for tomorrow's late morning?",
        "Do you think tomorrow's temperature will feel hotter or colder than it actually is?",
        "What's the expected temperature for tomorrow's early afternoon?",
        "Will tomorrow's temperature be suitable for wearing shorts?",
        "What's the predicted temperature for tomorrow's early morning?",
        "Do you think tomorrow's temperature will affect outdoor sports games?",
        "What's the temperature trend for tomorrow's daytime?",
        "Is tomorrow's temperature going to be humid or dry?",
        "What's the forecasted temperature for tomorrow's early evening?",
        "Will tomorrow's temperature be comfortable for a hike?",
        "What's the predicted temperature for tomorrow's late afternoon?",
        "Do you think tomorrow's temperature will lead to any weather-related issues?",
        "What's the expected temperature for tomorrow's late evening?"
      ]
    },
    {
      "tag": "clouds-later-that-day",
      "patterns": [
        "Will the sky be overcast with clouds today?",
        "Are we expecting cloudy weather today?",
        "Do you think we'll have a cloudy day today?",
        "Is there a chance of cloudy skies today?",
        "What's the likelihood of clouds today?",
        "Will the clouds obscure the sun today?",
        "Are we in for a gloomy, cloudy day today?",
        "Will the clouds bring any rain today?",
        "Is the forecast calling for cloudy weather today?",
        "Will the clouds break up at any point today?",
        "Will the clouds create any shadows today?",
        "What's the cloud cover expected to be like today?",
        "Will the clouds be thick or thin today?",
        "Will there be any breaks in the cloud cover today?",
        "Do you expect to see any blue sky through the clouds today?",
        "Will the clouds make it a cooler day today?",
        "Are the clouds going to stick around all day today?",
        "Will the clouds block out the stars tonight?",
        "Is there any chance of the clouds clearing up later today?",
        "What kind of clouds can we expect to see today?"
      ]
    },
    {
      "tag": "clouds-this-week",
      "patterns": [
        "Will it be cloudy today on Monday?",
        "Do you think there will be a lot of clouds today on Tuesday?",
        "Will the sky be overcast with clouds today on Wednesday?",
        "Is there a chance of clouds today on Thursday?",
        "What will the cloud coverage be like today on Friday?",
        "Will there be a cloudy day tomorrow on Saturday?",
        "Do you expect there to be many clouds tomorrow on Sunday?",
        "Is it going to be a cloudy start of the week tomorrow on Monday?",
        "Will the clouds be thick and heavy tomorrow on Tuesday?",
        "Is there a possibility of clouds tomorrow on Wednesday?",
        "Will the clouds be scattered or widespread tomorrow on Thursday?",
        "Do you think there will be any breaks in the clouds tomorrow on Friday?",
        "What will the cloud cover be like tomorrow on Saturday?",
        "Do you expect there to be any sunshine tomorrow on Sunday?",
        "Will there be any clouds to block the sun tomorrow on Monday?",
        "Will the clouds make it cooler tomorrow on Tuesday?",
        "Will it be a gloomy day tomorrow on Wednesday?",
        "Is there a chance of rain with the clouds tomorrow on Thursday?",
        "Will there be any breaks in the clouds to let the sun shine through tomorrow on Friday?",
        "What will the cloud formations be like tomorrow on Saturday?",
        "Do you expect there to be any cumulus clouds tomorrow on Sunday?",
        "Will it be a mostly cloudy day tomorrow on Monday?",
        "Do you think the clouds will be high or low tomorrow on Tuesday?",
        "Will there be any storm clouds gathering tomorrow on Wednesday?",
        "Is there a chance of thunderstorms with the clouds tomorrow on Thursday?",
        "Will the clouds bring cooler temperatures tomorrow on Friday?",
        "What will the cloud deck be like tomorrow on Saturday?",
        "Do you expect there to be any cirrus clouds tomorrow on Sunday?",
        "Will there be any clouds that look like animals or shapes tomorrow on Monday?",
        "Do you think the clouds will be fluffy or flat tomorrow on Tuesday?",
        "Will the clouds make the sunrise or sunset look more beautiful tomorrow on Wednesday?",
        "Is there a chance of hail with the clouds tomorrow on Thursday?",
        "Will there be any breaks in the clouds to see the stars tomorrow on Friday?",
        "What will the cloud ceiling be like tomorrow on Saturday?",
        "Do you expect there to be any stratus clouds tomorrow on Sunday?",
        "Will it be a partly cloudy day tomorrow on Monday?",
        "Do you think the clouds will move quickly or slowly tomorrow on Tuesday?",
        "Will there be any chance of a rainbow with the clouds tomorrow on Wednesday?",
        "Is there a chance of lightning with the clouds tomorrow on Thursday?",
        "Will the clouds bring a refreshing breeze tomorrow on Friday?",
        "What will the cloud tops be like tomorrow on Saturday?",
        "Do you expect there to be any thunderheads with the clouds tomorrow on Sunday?",
        "Will it be a hazy day with the clouds tomorrow on Monday?",
        "Do you think the clouds will be white or gray tomorrow on Tuesday?",
        "Will there be any chance of fog with the clouds tomorrow on Wednesday?",
        "Is there a chance of snow with the clouds tomorrow on Thursday?",
        "Will the clouds make it humid tomorrow on Friday?",
        "What will the cloud base be like tomorrow on Saturday?",
        "Will tomorrow be cloudy or sunny?",
        "Are we expecting clear skies or will it be cloudy tomorrow?",
        "Will there be any clouds in the sky tomorrow?",
        "Is tomorrow's forecast calling for overcast skies?",
        "Will tomorrow be a cloudy day?",
        "Do you think it will be mostly cloudy or partly cloudy tomorrow?",
        "Can we expect to see any sun tomorrow or will it be mostly cloudy?",
        "Is there a chance of seeing any blue sky tomorrow or will it be cloudy all day?",
        "Will there be any breaks in the clouds tomorrow?",
        "Should I expect a gloomy day tomorrow with a lot of cloud cover?",
        "Are we in for a cloudy day tomorrow or will it be mostly sunny?",
        "What's the forecast for tomorrow's cloud cover?",
        "Do you think we'll see more clouds or sunshine tomorrow?",
        "What's the cloud cover prediction for tomorrow?",
        "Will tomorrow be a cloudy or bright day?",
        "Do we have a chance of seeing any sunshine tomorrow or will it be overcast?",
        "Will there be any patchy clouds tomorrow or will it be mostly cloudy?",
        "Are we expecting a completely cloudy sky tomorrow or will there be some clear patches?",
        "Can we expect any sunshine at all tomorrow or will it be a fully cloudy day?",
        "Will tomorrow's forecast call for more clouds than sunshine?",
        "Are we in for a gray and cloudy day tomorrow?",
        "Is tomorrow's weather forecast predicting cloudy skies?",
        "Will tomorrow's sky be filled with clouds or will it be a clear day?",
        "Do we have any chance of seeing a blue sky tomorrow or will it be cloudy all day?",
        "Will there be any chance of seeing the sun peeking through the clouds tomorrow?",
        "Will tomorrow's weather be more cloudy than it was today?",
        "Do we know if there will be a lot of cloud cover tomorrow?",
        "What's the expected cloud cover for tomorrow's weather forecast?",
        "Will tomorrow be a cloudy or a hazy day?",
        "What's the probability of having a cloudy sky tomorrow?",
        "Is tomorrow's weather forecast predicting an overcast sky?",
        "Can we expect any sunshine at all tomorrow or will it be a fully cloudy day?",
        "Will tomorrow be a mostly cloudy or a partly cloudy day?",
        "Do we know if tomorrow's sky will be a dull gray or a bright blue?",
        "Is there any chance that tomorrow will be a clear day or will it be mostly cloudy?",
        "What's the likelihood of seeing the sun tomorrow through the clouds?",
        "Do you think tomorrow's sky will be full of clouds or will there be some gaps?",
        "Will there be any chance of the clouds breaking up tomorrow?",
        "Do we know if tomorrow will have more clouds than sunshine?",
        "Are we expecting mostly overcast skies tomorrow or will there be some clear patches?",
        "What's the expected cloud cover for tomorrow's weather?",
        "Can we expect to see any blue sky tomorrow or will it be fully cloudy?",
        "Will there be any chance of seeing the sun tomorrow through the clouds?",
        "Do you think tomorrow's sky will be full of clouds or will there be some gaps?",
        "Will there be any chance of the clouds breaking up tomorrow?",
        "Do we know if tomorrow will have more clouds than sunshine?"
      ]
    },
    {
      "tag": "creators",
      "patterns": [
        "Who's you creator?",
        "Who made you?",
        "Who created you?",
        "Can you tell me about your creators?",
        "Who developed your AI?",
        "Who trained you to understand human language?",
        "Who designed your user interface?",
        "Who programmed your conversational abilities?",
        "Who wrote your code?",
        "Who is responsible for your maintenance?",
        "Who is the team behind your development?",
        "Who funded your creation?",
        "Who had the original idea for your creation?",
        "Who is the CEO of the company that created you?",
        "Who is the lead developer on your project?",
        "Who is your primary designer?",
        "Who came up with your name?",
        "Who oversees your daily operations?",
        "Who manages your database?",
        "Who is responsible for ensuring your privacy and security?",
        "Who is responsible for troubleshooting when you encounter errors?",
        "Who is responsible for improving your natural language processing abilities?",
        "Who decides which features to add to your platform?",
        "Who is responsible for making updates to your software?",
        "Who is responsible for ensuring your compatibility with different devices?",
        "Who is responsible for your marketing and promotion?",
        "Who is responsible for your customer service and support?",
        "Who are the individuals that make up your development team?",
        "Who are your investors?",
        "Who is responsible for your intellectual property?",
        "Who is responsible for your server maintenance?",
        "Who is responsible for your hosting?",
        "Who is responsible for managing your user data?",
        "Who is responsible for managing your cloud infrastructure?",
        "Who is responsible for your website and online presence?",
        "Who is responsible for your branding and visual identity?",
        "Who is responsible for your public relations?",
        "Who is responsible for your social media presence?",
        "Who is responsible for your content strategy?",
        "Who is responsible for your user experience design?",
        "Who is responsible for your accessibility features?",
        "Who is responsible for your chatbot's personality?",
        "Who is responsible for the development of your voice assistant functionality?",
        "Who is responsible for your conversational AI research?",
        "Who is responsible for your speech recognition technology?",
        "Who is responsible for your text-to-speech technology?",
        "Who is responsible for your machine learning algorithms?",
        "Who is responsible for your natural language understanding technology?",
        "Who is responsible for your data analytics?",
        "Who is responsible for your user testing and feedback?",
        "Who is responsible for your product strategy?",
        "Who is responsible for your long-term vision and roadmap?",
        "Who taught you everything?",
        "How are you able to respond like that?"
      ],
      "responses": [
        "My creators are Natalia Adamiak and Filip Dziurdzia. For more information visit contact page."
      ]
    },
    {
      "tag": "purpose",
      "patterns": [
        "What do you do?",
        "What can you do for me?",
        "How can you help me?",
        "What is your purpose?",
        "Who are you?",
        "What is your purpose?",
        "What are you designed to do?",
        "What problems do you solve?",
        "Why were you created?",
        "What is your main function?",
        "What do you offer to users?",
        "What benefits do you provide?",
        "What are your goals?",
        "What is your intended use case?",
        "What is the purpose of your platform?",
        "What inspired your creation?",
        "What makes you different from other chatbots?",
        "What value do you bring to users?",
        "What is your unique selling proposition?",
        "What kind of problems can you help me with?",
        "What are your limitations?",
        "What is your target audience?",
        "What kind of interactions are you meant for?",
        "What types of questions can you answer?",
        "What kind of information can you provide?",
        "What are your core features?",
        "What kind of data do you use to make decisions?",
        "What is the scope of your knowledge?",
        "What kind of situations can you assist with?",
        "What is your role in the AI ecosystem?",
        "What kind of language processing do you use?",
        "What kind of learning algorithms do you utilize?",
        "What kind of information sources do you access?",
        "What kind of insights can you provide?",
        "What kind of recommendations can you make?",
        "What kind of services do you offer?",
        "What kind of feedback can you give?",
        "What kind of insights can you gather?",
        "What kind of predictions can you make?",
        "What kind of decisions can you assist with?",
        "What kind of guidance can you provide?",
        "What kind of support can you offer?",
        "What kind of analysis can you perform?",
        "What kind of solutions can you suggest?",
        "What kind of knowledge do you have?",
        "What kind of expertise do you possess?",
        "What kind of advice can you offer?",
        "What kind of resources can you provide?",
        "What kind of assistance can you give?",
        "What kind of functionality do you have?",
        "What kind of actions can you perform?",
        "What kind of response time can I expect?",
        "What kind of customization options do you have?",
        "What kind of user experience can I expect?",
        "What kind of improvements can I expect in the future?"
      ],
      "responses": [
        "My name is Stormy, I'm a weather ChatBot. I can tell you what is the weather like in your city or other place. Just tell me the name of city and optionally date"
      ]
    }
  ]
}
